In [1]:
import pandas as pd 
df = pd.read_csv("StudentScore.csv", header=0)  #doc file
df.info() #check NA, datatype

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   gender                       1000 non-null   object
 1   race/ethnicity               1000 non-null   object
 2   parental level of education  1000 non-null   object
 3   lunch                        1000 non-null   object
 4   test preparation course      1000 non-null   object
 5   math score                   1000 non-null   int64
 6   reading score                1000 non-null   int64
 7   writing score                1000 non-null   int64
dtypes: int64(3), object(5)
memory usage: 62.6+ KB

In [2]:
df.head() #xem 5 dong dau tien

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [3]:
df.shape #so dong so cot

(1000, 8)

In [4]:
type(df)

pandas.core.frame.DataFrame

# Task 1: In ra index của 10 học sinh có math score và reading score đều nằm trong Top 100

In [5]:
top100_math = df["math score"]
top100_math = top100_math.nlargest(100)
top100_math = top100_math.astype(int)
print(top100_math)

149    100
451    100
458    100
623    100
625    100
      ...
223     86
291     86
426     86
447     86
509     86
Name: math score, Length: 100, dtype: int32

In [6]:
top100_reading = df["reading score"]
top100_reading = top100_reading.nlargest(100)
top100_reading = top100_reading.astype(int)
print(top100_reading)

106    100
114    100
149    100
165    100
179    100
      ...
468     88
493     88
533     88
633     88
641     88
Name: reading score, Length: 100, dtype: int32

In [47]:
#cach 1
top100_both = pd.merge(top100_math, top100_reading, left_index=True, right_index=True, how='inner')
top100_both[:10]

     math score  reading score
149         100            100
451         100             92
458         100            100
623         100             96
625         100             97
916         100            100
962         100            100
114          99            100
263          99             93
712          98            100

In [8]:
#cach 2
top100_math_df = top100_math.to_frame(name='math score')
top100_reading_df = top100_reading.to_frame(name='reading score')
top100_both1 = top100_math_df.join(top100_reading_df, how="inner")
top100_both1.head(10)

     math score  reading score
149         100            100
451         100             92
458         100            100
623         100             96
625         100             97
916         100            100
962         100            100
114          99            100
263          99             93
712          98            100

# Task 2: In ra index của 20 học sinh có điểm writing score cao nhất của mỗi group (race/ethnicity)

In [9]:
# co 5 groups moi group lay ra 20 hs co diem writing cao nhat 
df["race/ethnicity"].value_counts()

group C    319
group D    262
group B    190
group E    140
group A     89
Name: race/ethnicity, dtype: int64

In [10]:
writing = df.loc[:,["race/ethnicity","writing score"]]
top20_writing = writing.groupby("race/ethnicity")["writing score"].nlargest(20)
top20_writing.info

<bound method Series.info of race/ethnicity
group A         546    97
                614    93
                571    92
                820    92
                983    91
                       ..
group E         164    91
                890    91
                263    90
                216    88
                286    88
Name: writing score, Length: 100, dtype: int64>

In [11]:
top20_writing[["group A"]]

race/ethnicity
group A         546    97
                614    93
                571    92
                820    92
                983    91
                702    87
                539    86
                623    86
                468    85
                489    82
                778    82
                911    82
                77     81
                300    81
                423    80
                837    79
                378    77
                490    76
                651    76
                170    74
Name: writing score, dtype: int64

In [12]:
top20_writing[["group B"]]

race/ethnicity
group B         855    96
                514    94
                2      93
                6      92
                94     92
                121    92
                501    92
                474    91
                919    91
                577    89
                833    89
                551    88
                722    88
                158    87
                667    87
                715    87
                803    87
                815    87
                125    86
                749    86
Name: writing score, dtype: int64

In [13]:
top20_writing[["group C"]]

race/ethnicity
group C         165    100
                594     99
                717     99
                334     95
                347     95
                381     95
                397     95
                229     94
                325     94
                732     94
                979     94
                122     93
                276     93
                420     93
                562     92
                463     91
                465     91
                612     91
                864     91
                104     90
Name: writing score, dtype: int64

In [14]:
top20_writing[["group D"]]

race/ethnicity
group D         106    100
                179    100
                377    100
                403    100
                903    100
                957    100
                970    100
                625     99
                712     99
                110     98
                652     98
                373     96
                580     96
                941     96
                268     95
                821     93
                316     91
                907     91
                604     90
                641     90
Name: writing score, dtype: int64

In [15]:
top20_writing[["group E"]]

race/ethnicity
group E         114    100
                458    100
                566    100
                685    100
                916    100
                962    100
                451     97
                802     95
                886     95
                995     95
                533     94
                149     93
                852     93
                503     92
                755     92
                164     91
                890     91
                263     90
                216     88
                286     88
Name: writing score, dtype: int64

# Task 3: Thống kê số lượng học sinh của group A theo parental level of education

In [16]:
parental = df[df["race/ethnicity"] == "group A"][["race/ethnicity","parental level of education"]]
parental.value_counts()

race/ethnicity  parental level of education
group A         some high school               24
                high school                    18
                some college                   18
                associate's degree             14
                bachelor's degree              12
                master's degree                 3
dtype: int64

# Task 4: Có phải xu hướng chung, cha mẹ có học vấn càng cao thì điểm số trung bình 3 môn của con cái cũng càng cao ko

##  comparison of a qualitative variable with a quantitative variable ?

In [17]:
df["mean_score"] = round((df["math score"] + df["writing score"] + df["reading score"])/3)
df.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,mean_score
0,female,group B,bachelor's degree,standard,none,72,72,74,73.0
1,female,group C,some college,standard,completed,69,90,88,82.0
2,female,group B,master's degree,standard,none,90,95,93,93.0
3,male,group A,associate's degree,free/reduced,none,47,57,44,49.0
4,male,group C,some college,standard,none,76,78,75,76.0

In [18]:
df.describe()

       math score  reading score  writing score   mean_score
count  1000.00000    1000.000000    1000.000000  1000.000000
mean     66.08900      69.169000      68.054000    67.762000
std      15.16308      14.600192      15.195657    14.258354
min       0.00000      17.000000      10.000000     9.000000
25%      57.00000      59.000000      57.750000    58.000000
50%      66.00000      70.000000      69.000000    68.000000
75%      77.00000      79.000000      79.000000    78.000000
max     100.00000     100.000000     100.000000   100.000000

In [49]:
level_parental = ["some high school","high school", "some college","associate's degree","bachelor's degree","master's degree"]
df['parental level of education'] = pd.Categorical(df['parental level of education'], categories=level_parental)
mean_level_parental = df.groupby('parental level of education')['mean_score'].mean()  #median (outlier)
mean_level_parental

parental level of education
some high school      65.072626
high school           63.122449
some college          68.446903
associate's degree    69.558559
bachelor's degree     71.949153
master's degree       73.576271
Name: mean_score, dtype: float64

In [20]:
group1 = df[df['parental level of education'] == 'some high school']['mean_score']
group2 = df[df['parental level of education'] == 'high school']['mean_score']
group3 = df[df['parental level of education'] == 'some college']['mean_score']
group4 = df[df['parental level of education'] == "associate's degree"]['mean_score']
group5 = df[df['parental level of education'] == "bachelor's degree"]['mean_score']
group6 = df[df['parental level of education'] == "master's degree"]['mean_score']

In [21]:
#tinh ANOVA 
from scipy.stats import f_oneway
stat1, pvalue1 = f_oneway(group1, group2, group3, group4,group5,group6)
print(stat1)
print(pvalue1) # p< 0.05 --> su khac biet co y nghia thong ke --> reject H0

10.728858698160955
4.626503161422164e-10

In [22]:
# tinh linearity
df['parental_code'] = df['parental level of education'].map({'some high school': 0, 'high school':1,
                                                             'some college':2,"associate's degree":3,
                                                             "bachelor's degree": 4,"master's degree": 5})
linearity_df = df.loc[:,["parental_code","mean_score"]]
linearity_df = linearity_df.sort_values("parental_code")
linearity_df.head()

    parental_code  mean_score
488             0        58.0
828             0        79.0
150             0        66.0
827             0        70.0
824             0        53.0

In [23]:
from scipy.stats import pearsonr
corr1 = pearsonr(linearity_df['parental_code'], linearity_df['mean_score'])
corr1  # weak positive linear relationship , pvalue < 0.05 --> reject H0

(0.20615612636563377, 4.6446839443603317e-11)

In [24]:
#graph ?

# Task 5: Chất lượng bữa ăn (lunch) có tương phản với điểm số trung bình 3 môn của học sinh không

In [25]:
lunch = df.loc[:,["lunch","mean_score"]]
lunch.value_counts("lunch")

lunch
standard        645
free/reduced    355
dtype: int64

In [26]:
level_lunch = ["free/reduced","standard"]
lunch['lunch'] = pd.Categorical(lunch['lunch'], categories=level_lunch, ordered=True)
mean_level_lunch = df.groupby('lunch')['mean_score'].mean()  #median (outlier)
mean_level_lunch

lunch
free/reduced    62.191549
standard        70.827907
Name: mean_score, dtype: float64

In [27]:
#tinh ANOVA
group_free = df[df['lunch'] == 'free/reduced']['mean_score']
group_stan = df[df['lunch'] == 'standard']['mean_score']
stat2, pvalue2 = f_oneway(group_free, group_stan)
print(stat2)
print(pvalue2) #su khac biet co y nghia thong ke

91.62686827176763
7.939649697371116e-21

In [28]:
lunch['lunch_code'] = lunch['lunch'].map({'free/reduced': 0, 'standard': 1})
lunch_linearity_df = lunch.sort_values("lunch_code")
lunch_linearity_df.head()

            lunch  mean_score lunch_code
999  free/reduced        83.0          0
363  free/reduced        31.0          0
757  free/reduced        70.0          0
758  free/reduced        59.0          0
760  free/reduced        63.0          0

In [29]:
corr2 = pearsonr(lunch_linearity_df['lunch_code'], lunch_linearity_df['mean_score'])
corr2

(0.28998298742952344, 7.939649697366305e-21)

In [30]:
#H0 : there is no correlation between the two variables
#graph ?

# Task 6: Tìm ra Top 10 học sinh có điểm toán cao nhất của mỗi group

In [31]:
top_10_math = df.groupby("race/ethnicity")["math score"].nlargest(10)
top_10_math[["group A"]]

race/ethnicity
group A         623    100
                539     97
                546     92
                571     91
                702     87
                820     85
                614     82
                300     81
                77      80
                444     79
Name: math score, dtype: int64

In [32]:
top_10_math[["group B"]]

race/ethnicity
group B         855    97
                501    94
                815    94
                121    91
                919    91
                2      90
                333    90
                474    90
                6      88
                146    88
Name: math score, dtype: int64

In [33]:
top_10_math[["group C"]]

race/ethnicity
group C         104    98
                934    98
                864    97
                165    96
                562    96
                717    96
                612    94
                710    93
                594    92
                736    92
Name: math score, dtype: int64

In [34]:
top_10_math[["group D"]]

race/ethnicity
group D         625    100
                712     98
                179     97
                618     95
                903     93
                957     92
                299     90
                659     90
                130     89
                439     89
Name: math score, dtype: int64

In [35]:
top_10_math[["group E"]]

race/ethnicity
group E         149    100
                451    100
                458    100
                916    100
                962    100
                114     99
                263     99
                306     99
                34      97
                286     97
Name: math score, dtype: int64

# Task 7: Với những học sinh ở cùng 1 group, cùng parental level of education, cùng loại bữa ăn (lunch), việc tham gia test preparation course có giúp học sinh đó có điểm trung bình 3 môn cao hơn những học sinh không tham gia ko

In [36]:
groupA = df[df["race/ethnicity"]=="group A"][["parental level of education","lunch","test preparation course","mean_score"]]
groupA.head()

,parental level of education,lunch,test preparation course,mean_score
3,associate's degree,free/reduced,none,49.0
13,some college,standard,completed,73.0
14,master's degree,standard,none,54.0
25,master's degree,free/reduced,none,73.0
46,associate's degree,standard,completed,61.0

In [37]:
groupA.groupby(["parental level of education","lunch","test preparation course"])["mean_score"].mean()

parental level of education  lunch         test preparation course
some high school             free/reduced  completed                  61.000000
                                           none                       55.000000
                             standard      completed                  69.000000
                                           none                       56.833333
high school                  free/reduced  completed                  61.500000
                                           none                       48.000000
                             standard      completed                  75.666667
                                           none                       60.875000
some college                 free/reduced  completed                  65.000000
                                           none                       54.600000
                             standard      completed                  77.000000
                                           none                       62.833333
associate's degree           free/reduced  completed                  65.000000
                                           none                       56.000000
                             standard      completed                  74.333333
                                           none                       65.250000
bachelor's degree            free/reduced  completed                  56.000000
                                           none                       66.000000
                             standard      completed                  77.000000
                                           none                       66.000000
master's degree              free/reduced  completed                        NaN
                                           none                       68.000000
                             standard      completed                        NaN
                                           none                       54.000000
Name: mean_score, dtype: float64

In [38]:
groupA.groupby(["parental level of education","lunch","test preparation course"])["mean_score"].count()

parental level of education  lunch         test preparation course
some high school             free/reduced  completed                   1
                                           none                       10
                             standard      completed                   7
                                           none                        6
high school                  free/reduced  completed                   4
                                           none                        3
                             standard      completed                   3
                                           none                        8
some college                 free/reduced  completed                   2
                                           none                        5
                             standard      completed                   5
                                           none                        6
associate's degree           free/reduced  completed                   2
                                           none                        5
                             standard      completed                   3
                                           none                        4
bachelor's degree            free/reduced  completed                   1
                                           none                        1
                             standard      completed                   3
                                           none                        7
master's degree              free/reduced  completed                   0
                                           none                        2
                             standard      completed                   0
                                           none                        1
Name: mean_score, dtype: int64

In [39]:
groupB = df[df["race/ethnicity"]=="group B"][["parental level of education","lunch","test preparation course","mean_score"]]
groupB.head()

,parental level of education,lunch,test preparation course,mean_score
0,bachelor's degree,standard,none,73.0
2,master's degree,standard,none,93.0
5,associate's degree,standard,none,77.0
6,some college,standard,completed,92.0
7,some college,free/reduced,none,41.0

In [40]:
groupB.groupby(["parental level of education","lunch","test preparation course"])["mean_score"].mean()

parental level of education  lunch         test preparation course
some high school             free/reduced  completed                  66.600000
                                           none                       47.000000
                             standard      completed                  67.214286
                                           none                       66.642857
high school                  free/reduced  completed                  63.800000
                                           none                       51.545455
                             standard      completed                  67.100000
                                           none                       63.409091
some college                 free/reduced  completed                  64.666667
                                           none                       56.600000
                             standard      completed                  78.125000
                                           none                       61.846154
associate's degree           free/reduced  completed                  72.400000
                                           none                       58.666667
                             standard      completed                  78.444444
                                           none                       66.166667
bachelor's degree            free/reduced  completed                  88.000000
                                           none                       68.500000
                             standard      completed                  75.000000
                                           none                       71.444444
master's degree              free/reduced  completed                  73.666667
                                           none                       51.000000
                             standard      completed                        NaN
                                           none                       88.500000
Name: mean_score, dtype: float64

In [41]:
groupC = df[df["race/ethnicity"]=="group C"][["parental level of education","lunch","test preparation course","mean_score"]]
groupC.head()

   parental level of education     lunch test preparation course  mean_score
1                 some college  standard               completed        82.0
4                 some college  standard                    none        76.0
10          associate's degree  standard                    none        55.0
15            some high school  standard                    none        74.0
16                 high school  standard                    none        88.0

In [42]:
groupC.groupby(["parental level of education","lunch","test preparation course"])["mean_score"].mean()

parental level of education  lunch         test preparation course
some high school             free/reduced  completed                  58.900000
                                           none                       55.545455
                             standard      completed                  72.166667
                                           none                       64.250000
high school                  free/reduced  completed                  58.833333
                                           none                       52.764706
                             standard      completed                  67.333333
                                           none                       66.656250
some college                 free/reduced  completed                  65.714286
                                           none                       58.812500
                             standard      completed                  81.928571
                                           none                       66.531250
associate's degree           free/reduced  completed                  67.375000
                                           none                       64.214286
                             standard      completed                  75.681818
                                           none                       67.941176
bachelor's degree            free/reduced  completed                  68.714286
                                           none                       59.500000
                             standard      completed                  81.076923
                                           none                       76.416667
master's degree              free/reduced  completed                  67.200000
                                           none                       61.200000
                             standard      completed                  78.500000
                                           none                       71.000000
Name: mean_score, dtype: float64

In [43]:
groupD = df[df["race/ethnicity"]=="group C"][["parental level of education","lunch","test preparation course","mean_score"]]
groupD.head()

   parental level of education     lunch test preparation course  mean_score
1                 some college  standard               completed        82.0
4                 some college  standard                    none        76.0
10          associate's degree  standard                    none        55.0
15            some high school  standard                    none        74.0
16                 high school  standard                    none        88.0

In [44]:
groupD.groupby(["parental level of education","lunch","test preparation course"])["mean_score"].mean()

parental level of education  lunch         test preparation course
some high school             free/reduced  completed                  58.900000
                                           none                       55.545455
                             standard      completed                  72.166667
                                           none                       64.250000
high school                  free/reduced  completed                  58.833333
                                           none                       52.764706
                             standard      completed                  67.333333
                                           none                       66.656250
some college                 free/reduced  completed                  65.714286
                                           none                       58.812500
                             standard      completed                  81.928571
                                           none                       66.531250
associate's degree           free/reduced  completed                  67.375000
                                           none                       64.214286
                             standard      completed                  75.681818
                                           none                       67.941176
bachelor's degree            free/reduced  completed                  68.714286
                                           none                       59.500000
                             standard      completed                  81.076923
                                           none                       76.416667
master's degree              free/reduced  completed                  67.200000
                                           none                       61.200000
                             standard      completed                  78.500000
                                           none                       71.000000
Name: mean_score, dtype: float64

In [45]:
groupE = df[df["race/ethnicity"]=="group C"][["parental level of education","lunch","test preparation course","mean_score"]]
groupE.head()

   parental level of education     lunch test preparation course  mean_score
1                 some college  standard               completed        82.0
4                 some college  standard                    none        76.0
10          associate's degree  standard                    none        55.0
15            some high school  standard                    none        74.0
16                 high school  standard                    none        88.0

In [46]:
groupE.groupby(["parental level of education","lunch","test preparation course"])["mean_score"].mean()

parental level of education  lunch         test preparation course
some high school             free/reduced  completed                  58.900000
                                           none                       55.545455
                             standard      completed                  72.166667
                                           none                       64.250000
high school                  free/reduced  completed                  58.833333
                                           none                       52.764706
                             standard      completed                  67.333333
                                           none                       66.656250
some college                 free/reduced  completed                  65.714286
                                           none                       58.812500
                             standard      completed                  81.928571
                                           none                       66.531250
associate's degree           free/reduced  completed                  67.375000
                                           none                       64.214286
                             standard      completed                  75.681818
                                           none                       67.941176
bachelor's degree            free/reduced  completed                  68.714286
                                           none                       59.500000
                             standard      completed                  81.076923
                                           none                       76.416667
master's degree              free/reduced  completed                  67.200000
                                           none                       61.200000
                             standard      completed                  78.500000
                                           none                       71.000000
Name: mean_score, dtype: float64